Autodesk.Revit.DB.View.CropBox
The Crop Box applied to the view, or an outline encompassing the crop region applied to the view.
Remarks: The X direction of the
box is right on screen; Y, up; Z, towards the user. The crop box Z value of a plan view is not meaningful.
null if the view is a template, or does not support cropping.  If the view is cropped by a sketched region instead
of by a box, the box will contain a box which outlines the extends of the sketch.  Setting the crop box for a view cropped by a sketched region will have no effect.
For better access to the crop region of a given view regardless of shape, use the return from Autodesk.Revit.DB.View.GetCropRegionShapeManager.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Cannot set the CropBox of the specified view.

Autodesk.Revit.DB.View.SetVisibility(Autodesk.Revit.DB.Category,System.Boolean)
Sets if elements of the given category will be visible in this view.
Remarks: This affects only if the category is set visible or invisible individually.  Other Revit mechanisms
may also affect the visibility of elements of this category, including:
the category classes settings for
model categories, annotation categories, import categories or analytical model categories.view filters
Thus setting this value may not affect the actual visibility of elements of this category in the view.
category: The category.
visible: True to make elements of this category visible, false to make them invisible.

Autodesk.Revit.DB.View.GetVisibility(Autodesk.Revit.DB.Category)
Checks if elements of the given category are set to be visible in this view.
Remarks: This checks only if the category is set visible or invisible individually.  Other Revit mechanisms
may also affect the visibility of elements of this category, including:
the category classes settings for
model categories, annotation categories, import categories or analytical model categories.view filters
Thus the return value may not reflect the actual visibility of elements of this category in the view.
category: The category.
Returns: True if the category is visible, false otherwise.

Autodesk.Revit.DB.View.Outline
The bounds of the view in paper space (in inches).
Remarks: Returns all zeros for empty views.